# Watt Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Watt Property
SymbolTypeId Class See Also
---
Symbol W, indicating unit Watts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Watt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Watt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Watt {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace